zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT1180/MIMXRT1186/iar/startup_MIMXRT1186_cm7.s
; -------------------------------------------------------------------------
;  @file:    startup_MIMXRT1186_cm7.s
;  @purpose: CMSIS Cortex-M7 Core Device Startup File
;            MIMXRT1186_cm7
;  @version: 3.0
;  @date:    2024-10-29
;  @build:   b250520
; -------------------------------------------------------------------------
;
; Copyright 1997-2016 Freescale Semiconductor, Inc.
; Copyright 2016-2025 NXP
; SPDX-License-Identifier: BSD-3-Clause
;
; The modules in this file are included in the libraries, and may be replaced
; by any user-defined modules that define the PUBLIC symbol _program_start or
; a user defined start symbol.
; To override the cstartup defined in the library, simply add your modified
; version to the workbench project.
;
; The vector table is normally located at address 0.
; When debugging in RAM, it can be located in RAM, aligned to at least 2^6.
; The name "__vector_table" has special meaning for C-SPY:
; it is where the SP start value is found, and the NVIC vector
; table register (VTOR) is initialized to this address if != 0.
;
; Cortex-M version
;

        MODULE  ?cstartup

        ;; Forward declaration of sections.
        SECTION CSTACK:DATA:NOROOT(3)
        SECTION HEAP:DATA:NOROOT(3)

        SECTION .intvec:CODE:NOROOT(2)

        EXTERN  __iar_program_start
        EXTERN  SystemInit
        PUBLIC  __vector_table
        PUBLIC  __vector_table_0x1c
        PUBLIC  __Vectors
        PUBLIC  __Vectors_End
        PUBLIC  __Vectors_Size

        DATA

__iar_init$$done:              ; The vector table is not needed
                      ; until after copy initialization is done

__vector_table
        DCD     sfe(CSTACK)
        DCD     Reset_Handler

        DCD     NMI_Handler                                   ;NMI Handler
        DCD     HardFault_Handler                             ;Hard Fault Handler
        DCD     MemManage_Handler                             ;MPU Fault Handler
        DCD     BusFault_Handler                              ;Bus Fault Handler
        DCD     UsageFault_Handler                            ;Usage Fault Handler
__vector_table_0x1c
        DCD     0                                             ;Reserved
        DCD     0                                             ;Reserved
        DCD     0                                             ;Reserved
        DCD     0                                             ;Reserved
        DCD     SVC_Handler                                   ;SVCall Handler
        DCD     DebugMon_Handler                              ;Debug Monitor Handler
        DCD     0                                             ;Reserved
        DCD     PendSV_Handler                                ;PendSV Handler
        DCD     SysTick_Handler                               ;SysTick Handler

                                                              ;External Interrupts
        DCD     TMR1_IRQHandler                               ;TMR1 interrupt
        DCD     DAP_IRQHandler                                ;DAP interrupt
        DCD     M7_CTI_TRIGGER_OUTPUT_IRQHandler              ;CTI trigger outputs from CM7
        DCD     M33_CTI_TRIGGER_OUTPUT_IRQHandler             ;CTI trigger outputs from CM33
        DCD     TMR5_IRQHandler                               ;TMR5 interrupt
        DCD     TMR6_IRQHandler                               ;TMR6 interrupt
        DCD     TMR7_IRQHandler                               ;TMR7 interrupt
        DCD     TMR8_IRQHandler                               ;TMR8 interrupt
        DCD     CAN1_IRQHandler                               ;CAN1 interrupt
        DCD     CAN1_ERROR_IRQHandler                         ;CAN1 error interrupt
        DCD     GPIO1_0_IRQHandler                            ;GPIO1 interrupt 0
        DCD     GPIO1_1_IRQHandler                            ;GPIO1 interrupt 1
        DCD     I3C1_IRQHandler                               ;I3C1 interrupt
        DCD     LPI2C1_IRQHandler                             ;LPI2C1 interrupt
        DCD     LPI2C2_IRQHandler                             ;LPI2C2 interrupt
        DCD     LPIT1_IRQHandler                              ;LPIT1 interrupt
        DCD     LPSPI1_IRQHandler                             ;LPSPI1 interrupt
        DCD     LPSPI2_IRQHandler                             ;LPSPI2 interrupt
        DCD     LPTMR1_IRQHandler                             ;LPTMR1 interrupt
        DCD     LPUART1_IRQHandler                            ;LPUART1 interrupt
        DCD     LPUART2_IRQHandler                            ;LPUART2 interrupt
        DCD     MU1_IRQHandler                                ;MU1 interrupt
        DCD     MU2_IRQHandler                                ;MU2 interrupt
        DCD     PWM1_FAULT_IRQHandler                         ;PWM1 fault or reload error interrupt
        DCD     PWM1_0_IRQHandler                             ;PWM1 capture 0, compare 0, or reload 0 interrupt
        DCD     PWM1_1_IRQHandler                             ;PWM1 capture 1, compare 1, or reload 1 interrupt
        DCD     PWM1_2_IRQHandler                             ;PWM1 capture 2, compare 2, or reload 2 interrupt
        DCD     PWM1_3_IRQHandler                             ;PWM1 capture 3, compare 3, or reload 3 interrupt
        DCD     EDGELOCK_TRUST_MUA_RX_FULL_IRQHandler         ;Edgelock Trust MUA RX full interrupt
        DCD     EDGELOCK_TRUST_MUA_TX_EMPTY_IRQHandler        ;Edgelock Trust MUA TX empty interrupt
        DCD     EDGELOCK_APPS_CORE_MUA_RX_FULL_IRQHandler     ;Edgelock Apps Core MUA RX full interrupt
        DCD     EDGELOCK_APPS_CORE_MUA_TX_EMPTY_IRQHandler    ;Edgelock Apps Core MUA TX empty interrupt
        DCD     EDGELOCK_REALTIME_CORE_MUA_RX_FULL_IRQHandler    ;Edgelock Realtime Core MUA RX full interrupt
        DCD     EDGELOCK_REALTIME_CORE_MUA_TX_EMPTY_IRQHandler    ;Edgelock Realtime Core MUA TX empty interrupt
        DCD     EDGELOCK_SECURE_IRQHandler                    ;Edgelock secure interrupt
        DCD     EDGELOCK_NONSECURE_IRQHandler                 ;Edgelock non-secure interrupt
        DCD     TPM1_IRQHandler                               ;TPM1 interrupt
        DCD     TPM2_IRQHandler                               ;TPM2 interrupt
        DCD     RTWDOG1_IRQHandler                            ;RTWDOG1 interrupt
        DCD     RTWDOG2_IRQHandler                            ;RTWDOG2 interrupt
        DCD     TRDC_MGR_AON_IRQHandler                       ;AONMIX TRDC transfer error interrupt
        DCD     PDM_HWVAD_EVENT_IRQHandler                    ;HWVAD event interrupt
        DCD     PDM_HWVAD_ERROR_IRQHandler                    ;HWVAD error interrupt
        DCD     PDM_EVENT_IRQHandler                          ;PDM event interrupt
        DCD     PDM_ERROR_IRQHandler                          ;PDM error interrupt
        DCD     SAI1_IRQHandler                               ;SAI interrupt
        DCD     CM33_PS_IRQHandler                            ;M33 PS Tag/Data Parity Error
        DCD     CM33_TCM_ECC_IRQHandler                       ;M33 TCM ECC interrupt
        DCD     CM33_TCM_ERROR_IRQHandler                     ;M33 TCM Error interrupt
        DCD     CM7_TCM_ECC_IRQHandler                        ;M7 TCM ECC interrupt
        DCD     CM7_TCM_ERROR_IRQHandler                      ;M7 TCM Error interrupt
        DCD     CAN2_IRQHandler                               ;CAN2 interrupt
        DCD     CAN2_ERROR_IRQHandler                         ;CAN2 error interrupt
        DCD     FLEXIO1_IRQHandler                            ;FLEXIO1 interrupt
        DCD     FLEXIO2_IRQHandler                            ;FLEXIO2 interrupt
        DCD     FLEXSPI1_IRQHandler                           ;FLEXSPI1 interrupt
        DCD     FLEXSPI2_IRQHandler                           ;FLEXSPI2 interrupt
        DCD     GPIO2_0_IRQHandler                            ;GPIO2 interrupt 0
        DCD     GPIO2_1_IRQHandler                            ;GPIO2 interrupt 1
        DCD     GPIO3_0_IRQHandler                            ;GPIO3 interrupt 0
        DCD     GPIO3_1_IRQHandler                            ;GPIO3 interrupt 1
        DCD     I3C2_IRQHandler                               ;I3C2 interrupt
        DCD     LPI2C3_IRQHandler                             ;LPI2C3 interrupt
        DCD     Reserved79_IRQHandler                         ;Reserved interrupt
        DCD     LPIT2_IRQHandler                              ;LPIT2 interrupt
        DCD     LPSPI3_IRQHandler                             ;LPSPI3 interrupt
        DCD     LPSPI4_IRQHandler                             ;LPSPI4 interrupt
        DCD     LPTMR2_IRQHandler                             ;LPTMR2 interrupt
        DCD     LPUART3_IRQHandler                            ;LPUART3 interrupt
        DCD     LPUART4_IRQHandler                            ;LPUART4 interrupt
        DCD     LPUART5_IRQHandler                            ;LPUART5 interrupt
        DCD     LPUART6_IRQHandler                            ;LPUART6 interrupt
        DCD     Reserved88_IRQHandler                         ;Reserved interrupt 88
        DCD     BBNSM_IRQHandler                              ;BBNSM iterrupt
        DCD     SYS_CTR1_IRQHandler                           ;System Counter compare interrupt 0 and 1
        DCD     TPM3_IRQHandler                               ;TPM3 interrupt
        DCD     TPM4_IRQHandler                               ;TPM4 interrupt
        DCD     Reserved93_IRQHandler                         ;Reserved interrupt
        DCD     Reserved94_IRQHandler                         ;Reserved interrupt
        DCD     RTWDOG3_IRQHandler                            ;RTWDOG3 interrupt
        DCD     RTWDOG4_IRQHandler                            ;RTWDOG4 interrupt
        DCD     RTWDOG5_IRQHandler                            ;RTWDOG5 interrupt
        DCD     TRDC_MGR_WKUP_IRQHandler                      ;WAKEUPMIX TRDC transfer error interrupt
        DCD     TMPSNS_INT_IRQHandler                         ;Temperature alarm interrupt
        DCD     BBSM_IRQHandler                               ;BBSM wakeup alarm interrupt
        DCD     LDO_AON_ANA_IRQHandler                        ;Brown out interrupt
        DCD     Reserved102_IRQHandler                        ;Reserved interrupt
        DCD     USDHC2_IRQHandler                             ;USDHC2
        DCD     TRDC_MGR_MEGA_IRQHandler                      ;MEGAMIX TRDC transfer error interrupt
        DCD     SFA_IRQHandler                                ;Signal Frequency Analyzer interrupt
        DCD     LDO_AON_DIG_IRQHandler                        ;Brown out interrupt
        DCD     MECC1_IRQHandler                              ;MECC1 interrupt
        DCD     MECC2_IRQHandler                              ;MECC2 interrupt
        DCD     ADC1_IRQHandler                               ;ADC1 interrupt
        DCD     DMA_ERROR_IRQHandler                          ;AON Domain eDMA error interrupt
        DCD     DMA3_CH0_IRQHandler                           ;AON Domain eDMA channel 0 interrupt
        DCD     DMA3_CH1_IRQHandler                           ;AON Domain eDMA channel 1 interrupt
        DCD     DMA3_CH2_IRQHandler                           ;AON Domain eDMA channel 2 interrupt
        DCD     DMA3_CH3_IRQHandler                           ;AON Domain eDMA channel 3 interrupt
        DCD     DMA3_CH4_IRQHandler                           ;AON Domain eDMA channel 4 interrupt
        DCD     DMA3_CH5_IRQHandler                           ;AON Domain eDMA channel 5 interrupt
        DCD     DMA3_CH6_IRQHandler                           ;AON Domain eDMA channel 6 interrupt
        DCD     DMA3_CH7_IRQHandler                           ;AON Domain eDMA channel 7 interrupt
        DCD     DMA3_CH8_IRQHandler                           ;AON Domain eDMA channel 8 interrupt
        DCD     DMA3_CH9_IRQHandler                           ;AON Domain eDMA channel 9 interrupt
        DCD     DMA3_CH10_IRQHandler                          ;AON Domain eDMA channel 10 interrupt
        DCD     DMA3_CH11_IRQHandler                          ;AON Domain eDMA channel 11 interrupt
        DCD     DMA3_CH12_IRQHandler                          ;AON Domain eDMA channel 12 interrupt
        DCD     DMA3_CH13_IRQHandler                          ;AON Domain eDMA channel 13 interrupt
        DCD     DMA3_CH14_IRQHandler                          ;AON Domain eDMA channel 14 interrupt
        DCD     DMA3_CH15_IRQHandler                          ;AON Domain eDMA channel 15 interrupt
        DCD     DMA3_CH16_IRQHandler                          ;AON Domain eDMA channel 16 interrupt
        DCD     DMA3_CH17_IRQHandler                          ;AON Domain eDMA channel 17 interrupt
        DCD     DMA3_CH18_IRQHandler                          ;AON Domain eDMA channel 18 interrupt
        DCD     DMA3_CH19_IRQHandler                          ;AON Domain eDMA channel 19 interrupt
        DCD     DMA3_CH20_IRQHandler                          ;AON Domain eDMA channel 20 interrupt
        DCD     DMA3_CH21_IRQHandler                          ;AON Domain eDMA channel 21 interrupt
        DCD     DMA3_CH22_IRQHandler                          ;AON Domain eDMA channel 22 interrupt
        DCD     DMA3_CH23_IRQHandler                          ;AON Domain eDMA channel 23 interrupt
        DCD     DMA3_CH24_IRQHandler                          ;AON Domain eDMA channel 24 interrupt
        DCD     DMA3_CH25_IRQHandler                          ;AON Domain eDMA channel 25 interrupt
        DCD     DMA3_CH26_IRQHandler                          ;AON Domain eDMA channel 26 interrupt
        DCD     DMA3_CH27_IRQHandler                          ;AON Domain eDMA channel 27 interrupt
        DCD     DMA3_CH28_IRQHandler                          ;AON Domain eDMA channel 28 interrupt
        DCD     DMA3_CH29_IRQHandler                          ;AON Domain eDMA channel 29 interrupt
        DCD     DMA3_CH30_IRQHandler                          ;AON Domain eDMA channel 30 interrupt
        DCD     DMA3_CH31_IRQHandler                          ;AON Domain eDMA channel 31 interrupt
        DCD     DMA4_ERROR_IRQHandler                         ;WAKEUP Domain eDMA error interrupt
        DCD     DMA4_CH0_CH1_CH32_CH33_IRQHandler             ;WAKEUP Domain eDMA channel 0/1/32/33 interrupt
        DCD     DMA4_CH2_CH3_CH34_CH35_IRQHandler             ;WAKEUP Domain eDMA channel 2/3/34/35 interrupt
        DCD     DMA4_CH4_CH5_CH36_CH37_IRQHandler             ;WAKEUP Domain eDMA channel 4/5/36/37 interrupt
        DCD     DMA4_CH6_CH7_CH38_CH39_IRQHandler             ;WAKEUP Domain eDMA channel 6/7/38/39 interrupt
        DCD     DMA4_CH8_CH9_CH40_CH41_IRQHandler             ;WAKEUP Domain eDMA channel 8/9/40/41 interrupt
        DCD     DMA4_CH10_CH11_CH42_CH43_IRQHandler           ;WAKEUP Domain eDMA channel 10/11/42/43 interrupt
        DCD     DMA4_CH12_CH13_CH44_CH45_IRQHandler           ;WAKEUP Domain eDMA channel 12/13/44/45 interrupt
        DCD     DMA4_CH14_CH15_CH46_CH47_IRQHandler           ;WAKEUP Domain eDMA channel 14/15/46/47 interrupt
        DCD     DMA4_CH16_CH17_CH48_CH49_IRQHandler           ;WAKEUP Domain eDMA channel 16/17/48/49 interrupt
        DCD     DMA4_CH18_CH19_CH50_CH51_IRQHandler           ;WAKEUP Domain eDMA channel 18/19/50/51 interrupt
        DCD     DMA4_CH20_CH21_CH52_CH53_IRQHandler           ;WAKEUP Domain eDMA channel 20/21/52/53 interrupt
        DCD     DMA4_CH22_CH23_CH54_CH55_IRQHandler           ;WAKEUP Domain eDMA channel 22/23/54/55 interrupt
        DCD     DMA4_CH24_CH25_CH56_CH57_IRQHandler           ;WAKEUP Domain eDMA channel 24/25/56/57 interrupt
        DCD     DMA4_CH26_CH27_CH58_CH59_IRQHandler           ;WAKEUP Domain eDMA channel 26/27/58/59 interrupt
        DCD     DMA4_CH28_CH29_CH60_CH61_IRQHandler           ;WAKEUP Domain eDMA channel 28/29/60/61 interrupt
        DCD     DMA4_CH30_CH31_CH62_CH63_IRQHandler           ;WAKEUP Domain eDMA channel 30/31/62/63 interrupt
        DCD     XBAR1_CH0_CH1_IRQHandler                      ;XBAR1 channel 0/1 interrupt
        DCD     XBAR1_CH2_CH3_IRQHandler                      ;XBAR1 channel 2/3 interrupt
        DCD     SINC3_CH0_CH1_CH2_CH3_IRQHandler              ;SINC Filter Glue 3 channel 0/1/2/3
        DCD     EWM_IRQHandler                                ;EWM reset out interrupt
        DCD     SEMC_IRQHandler                               ;SEMC interrupt
        DCD     LPIT3_IRQHandler                              ;LPIT3 interrupt
        DCD     LPTMR3_IRQHandler                             ;LPTMR3 interrupt
        DCD     TMR4_IRQHandler                               ;TMR4 interrupt
        DCD     Reserved168_IRQHandler                        ;Reserved interrupt
        DCD     LPI2C6_IRQHandler                             ;LPI2C6 interrupt
        DCD     SAI4_IRQHandler                               ;SAI4 interrupt
        DCD     SPDIF_IRQHandler                              ;SPDIF interrupt
        DCD     Reserved172_IRQHandler                        ;Reserved interrupt
        DCD     Reserved173_IRQHandler                        ;Reserved interrupt
        DCD     Reserved174_IRQHandler                        ;Reserved interrupt
        DCD     Reserved175_IRQHandler                        ;Reserved interrupt
        DCD     INTG_BOOTROM_DEBUG_CTRL_IRQHandler            ;CM33, CM7, DAP access IRQ
        DCD     EDGELOCK_REQ1_IRQHandler                      ;Edgelock reuqest 1 interrupt
        DCD     EDGELOCK_REQ2_IRQHandler                      ;Edgelock reuqest 2 interrupt
        DCD     EDGELOCK_REQ3_IRQHandler                      ;Edgelock reuqest 3 interrupt
        DCD     TMR3_IRQHandler                               ;TMR3 interrupt
        DCD     JTAGC_IRQHandler                              ;JTAGC SRC reset source
        DCD     M33_SYSRESET_REQ_IRQHandler                   ;CM33 SYSREQRST SRC reset source
        DCD     M33_LOCKUP_IRQHandler                         ;CM33 LOCKUP SRC reset source
        DCD     M7_SYSRESET_REQ_IRQHandler                    ;CM33 SYSREQRST SRC reset source
        DCD     M7_LOCKUP_IRQHandler                          ;CM33 LOCKUP SRC reset source
        DCD     PWM2_FAULT_IRQHandler                         ;PWM2 fault or reload error interrupt
        DCD     PWM2_0_IRQHandler                             ;PWM2 capture 0, compare 0, or reload 0 interrupt
        DCD     PWM2_1_IRQHandler                             ;PWM2 capture 1, compare 1, or reload 1 interrupt
        DCD     PWM2_2_IRQHandler                             ;PWM2 capture 2, compare 2, or reload 2 interrupt
        DCD     PWM2_3_IRQHandler                             ;PWM2 capture 3, compare 3, or reload 3 interrupt
        DCD     PWM3_FAULT_IRQHandler                         ;PWM3 fault or reload error interrupt
        DCD     PWM3_0_IRQHandler                             ;PWM3 capture 0, compare 0, or reload 0 interrupt
        DCD     PWM3_1_IRQHandler                             ;PWM3 capture 1, compare 1, or reload 1 interrupt
        DCD     PWM3_2_IRQHandler                             ;PWM3 capture 2, compare 2, or reload 2 interrupt
        DCD     PWM3_3_IRQHandler                             ;PWM3 capture 3, compare 3, or reload 3 interrupt
        DCD     PWM4_FAULT_IRQHandler                         ;PWM4 fault or reload error interrupt
        DCD     PWM4_0_IRQHandler                             ;PWM4 capture 0, compare 0, or reload 0 interrupt
        DCD     PWM4_1_IRQHandler                             ;PWM4 capture 1, compare 1, or reload 1 interrupt
        DCD     PWM4_2_IRQHandler                             ;PWM4 capture 2, compare 2, or reload 2 interrupt
        DCD     PWM4_3_IRQHandler                             ;PWM4 capture 3, compare 3, or reload 3 interrupt
        DCD     EQDC1_IRQHandler                              ;EQDC1 interrupt
        DCD     EQDC2_IRQHandler                              ;EQDC2 interrupt
        DCD     EQDC3_IRQHandler                              ;EQDC3 interrupt
        DCD     EQDC4_IRQHandler                              ;EQDC4 interrupt
        DCD     ADC2_IRQHandler                               ;ADC2 interrupt
        DCD     DCDC_IRQHandler                               ;DCDC brown out interrupt
        DCD     Reserved207_IRQHandler                        ;Reserved interrupt
        DCD     Reserved208_IRQHandler                        ;Reserved interrupt
        DCD     DAC_IRQHandler                                ;DAC interrupt
        DCD     LPSPI5_IRQHandler                             ;LPSPI5 interrupt
        DCD     LPSPI6_IRQHandler                             ;LPSPI6 interrupt
        DCD     LPUART7_IRQHandler                            ;LPUART7 interrupt
        DCD     LPUART8_IRQHandler                            ;LPUART8 interrupt
        DCD     SAI2_IRQHandler                               ;SAI2 interrupt
        DCD     Reserved215_IRQHandler                        ;Reserved interrupt
        DCD     Reserved216_IRQHandler                        ;Reserved interrupt
        DCD     Reserved217_IRQHandler                        ;Reserved interrupt
        DCD     ACMP3_IRQHandler                              ;CMP3 interrupt
        DCD     Reserved219_IRQHandler                        ;Reserved interrupt
        DCD     CM7_PS_IRQHandler                             ;M7 PS Tag/Data Parity Error
        DCD     CM7_MCM_IRQHandler                            ;M7 MCM interrupt
        DCD     CM33_MCM_IRQHandler                           ;M33 MCM interrupt
        DCD     ECAT_INT_IRQHandler                           ;EtherCAT interrupt
        DCD     SAFETY_CLK_MON_IRQHandler                     ;Safety clock monitor interrupt
        DCD     GPT1_IRQHandler                               ;GPT1 interrupt
        DCD     GPT2_IRQHandler                               ;GPT2 interrupt
        DCD     KPP_IRQHandler                                ;KPP interrupt
        DCD     USBPHY1_IRQHandler                            ;USBPHY1 interrupt
        DCD     Reserved229_IRQHandler                        ;Reserved interrupt
        DCD     Reserved230_IRQHandler                        ;Reserved interrupt
        DCD     USB_OTG1_IRQHandler                           ;USBOTG1 interrupt
        DCD     FLEXSPI_SLV_IRQHandler                        ;FLEXSPI follower interrupt
        DCD     NETC_IRQHandler                               ;NETC interrupt
        DCD     MSGINTR1_IRQHandler                           ;MSGINTR1 interrupt
        DCD     MSGINTR2_IRQHandler                           ;MSGINTR2 interrupt
        DCD     MSGINTR3_IRQHandler                           ;MSGINTR3 interrupt
        DCD     MSGINTR4_IRQHandler                           ;MSGINTR4 interrupt
        DCD     MSGINTR5_IRQHandler                           ;MSGINTR5 interrupt
        DCD     MSGINTR6_IRQHandler                           ;MSGINTR6 interrupt
        DCD     SINC1_CH0_IRQHandler                          ;SINC Filter Glue 1 channel 0
        DCD     SINC1_CH1_IRQHandler                          ;SINC Filter Glue 1 channel 1
        DCD     SINC1_CH2_IRQHandler                          ;SINC Filter Glue 1 channel 2
        DCD     SINC1_CH3_IRQHandler                          ;SINC Filter Glue 1 channel 3
        DCD     SINC2_CH0_IRQHandler                          ;SINC Filter Glue 2 channel 0
        DCD     SINC2_CH1_IRQHandler                          ;SINC Filter Glue 2 channel 1
        DCD     SINC2_CH2_IRQHandler                          ;SINC Filter Glue 2 channel 2
        DCD     SINC2_CH3_IRQHandler                          ;SINC Filter Glue 2 channel 3
        DCD     GPIO4_IRQHandler                              ;GPIO4 interrupt
